Repository: Ahabibm4/doctor-ki-bole
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Doctor Ki Bole
bn: ডাক্তার কি বলে

source: Analyze Report
bn: রিপোর্ট বিশ্লেষণ

source: Symptom Checker
bn: লক্ষণ যাচাই

source: Saved Results
bn: সংরক্ষিত ফলাফল

# enterSymptoms
source: Enter your symptoms here...
bn: আপনার উপসর্গ লিখুন

source: Voice Input
bn: ভয়েস ইনপুট

source: Check
bn: চেক করুন

# noResults
source: No saved results yet.
bn: কোনো ফলাফল সংরক্ষিত নেই।

source: Pick Image
bn: ছবি বাছাই করুন

# chooseSource
source: Choose image source
bn: ছবির উৎস নির্বাচন করুন

source: Camera
bn: ক্যামেরা

source: Gallery
bn: গ্যালারি

# homeTitle
source: Doctor Ki Bole
bn: ডাক্তার কি বলে

source: Choose image source
bn: ছবির উৎস নির্বাচন করুন

# noSavedResults
source: No saved results yet.
bn: এখনো কোনো ফলাফল সংরক্ষিত নেই।

source: Delete
bn: মুছুন

# analyzeReportDesc
source: Scan or upload report image or PDF
bn: ছবি বা পিডিএফ রিপোর্ট স্ক্যান বা আপলোড করুন

# symptomCheckerDesc
source: Get GPT help for your symptoms
bn: আপনার উপসর্গের জন্য GPT সহায়তা নিন

# savedResultsDesc
source: View your previous analyses
bn: আপনার পূর্ববর্তী বিশ্লেষণগুলো দেখুন

source: Switch Language
bn: ভাষা পরিবর্তন করুন

# useCamera
source: Take Photo with Camera
bn: ক্যামেরা দিয়ে ছবি তুলুন

# pickFromGallery
source: Pick Image from Gallery
bn: গ্যালারি থেকে ছবি বাছুন

# pickPdf
source: Pick a PDF File
bn: PDF ফাইল বাছুন

# cameraDenied
source: ❌ Camera permission denied.
bn: ❌ ক্যামেরার অনুমতি দেওয়া হয়নি।

source: Pick File
bn: ফাইল বেছে নিন

# previewText
source: Preview of extracted text
bn: এক্সট্রাক্ট করা টেক্সটের প্রিভিউ

source: Optional Note
bn: ঐচ্ছিক নোট লিখুন

# noteHint
source: Add your personal note (optional)
bn: আপনার নিজের মন্তব্য দিন (ঐচ্ছিক)

source: Cancel
bn: বাতিল করুন

source: OK
bn: ঠিক আছে

# noResultsPlaceholder
source: Please upload a report to analyze.
bn: বিশ্লেষণের জন্য একটি রিপোর্ট আপলোড করুন।

source: Upload Report
bn: রিপোর্ট আপলোড করুন

source: Clear
bn: পরিষ্কার করুন

# micPermissionDenied
source: Microphone permission is required for voice input.
bn: ভয়েস ইনপুটের জন্য মাইক্রোফোন অনুমতি প্রয়োজন।

source: Retry
bn: পুনরায় চেষ্টা করুন

source: Share
bn: শেয়ার করুন

# voiceInputNotSupportedOnEmulator
source: Voice input is not supported on emulator or this device.
bn: এই ডিভাইসে বা এমুলেটরে ভয়েস ইনপুট সমর্থিত নয়।

# noInternetForVoiceInput
source: Internet is required for voice input.
bn: ভয়েস ইনপুটের জন্য ইন্টারনেট সংযোগ প্রয়োজন।

# noInternetForAnalysis
source: Cannot analyze symptoms without internet.
bn: ইন্টারনেট ছাড়া উপসর্গ বিশ্লেষণ করা সম্ভব না।

# deleteConfirm
source: Are you sure you want to delete this entry?
bn: আপনি কি এই রেকর্ডটি মুছে ফেলতে চান?

# tapToRetryVoiceInput
source: Please tap the microphone again to retry.
bn: আবার চেষ্টা করতে মাইক্রোফোন আইকনে চাপ দিন।

# speechRecognitionError
source: Voice recognition failed: {error}.
bn: ভয়েস শনাক্তকরণ ব্যর্থ হয়েছে: {error}।

source: Toggle Dark Mode
bn: ডার্ক মোড চালু/বন্ধ করুন

# fileTooLarge
source: ❌ File is too large (max 5MB). Please choose a smaller file.
bn: ❌ ফাইলটি খুব বড় (সর্বোচ্চ ৫ এমবি)। ছোট একটি ফাইল নির্বাচন করুন।
